In [1]:
!pip install word2number

Requirement already satisfied: word2number in c:\users\siddhartha\anaconda3\lib\site-packages (1.1)

In [1]:
from word2number import w2n
import pandas as pd
import numpy as np
from sklearn.metrics import r2_score
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [2]:
hiering_data=pd.read_csv('Exercise\\hiring.csv')
hiering_data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
import math
test_score=math.floor(hiering_data['test_score(out of 10)'].mean())
test_score

7

In [4]:
header=['experience','test_score','interview_score','salary']
hiering_data=pd.read_csv('Exercise\\hiring.csv',header=None,skiprows=1,names=header)

In [5]:
hiering_data

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [10]:
hiering_data.test_score=hiering_data['test_score'].fillna(test_score)

In [11]:
hiering_data

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         7.0                7   72000
7          11         7.0                8   80000

In [12]:
hiering_data.experience=hiering_data.experience.fillna("zero")

In [13]:
hiering_data.experience=hiering_data.experience.apply(w2n.word_to_num)
hiering_data

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')

In [14]:
lreg=LinearRegression()
lreg.fit(hiering_data[['experience','test_score','interview_score']],hiering_data.salary)

LinearRegression()

In [15]:
lreg.predict([[2,9,6]])

array([53713.86677124])

In [16]:
lreg.coef_

array([2922.26901502, 2221.30909959, 2147.48256637])

In [17]:
lreg.intercept_

14992.65144669314

In [18]:
from sklearn.metrics import r2_score
test=lreg.predict(hiering_data[['experience','test_score','interview_score']])
r2_score(hiering_data.salary,test)

0.977013901427314